In [1]:
# importing lib
import pandas as pd
import openpyxl
import xlrd
import numpy as np

In [13]:
data1 ={
    'sales_id':[101,201,101,301,301],
    'customer':['Sam','John','Sam','Mike','Mike']
}
df1 = pd.DataFrame(data1)

In [14]:
df1

   sales_id customer
0       101      Sam
1       201     John
2       101      Sam
3       301     Mike
4       301     Mike

In [15]:
df1.duplicated()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [16]:
df1[df1.duplicated()]

   sales_id customer
2       101      Sam
4       301     Mike

In [17]:
df2 = df1.drop_duplicates()
df2

   sales_id customer
0       101      Sam
1       201     John
3       301     Mike

In [19]:
data2 = {
        'order_id': [1, 1, 2, 3], 
        'product': ['iPhone 14', 'iMac 15', 'iPhone 16', 'Airpods Pro']
        }

df3 = pd.DataFrame(data2)
df3

   order_id      product
0         1    iPhone 14
1         1      iMac 15
2         2    iPhone 16
3         3  Airpods Pro

In [21]:
df3.duplicated()

0    False
1    False
2    False
3    False
dtype: bool

In [23]:
df3.duplicated(subset=['order_id'])

0    False
1     True
2    False
3    False
dtype: bool

In [22]:
df3.duplicated(['order_id'])

0    False
1     True
2    False
3    False
dtype: bool

In [26]:
data3 = {
        'order_id': [1, 2, 3, 4, 5], 
        'product': ['iPhone 14', 'iMac 15', np.nan, 'Airpods Pro', 'iWatch'],
        'price' : [799, 1299, np.nan, np.nan, 499]
        }

df4 = pd.DataFrame(data3)
df4

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
2         3          NaN     NaN
3         4  Airpods Pro     NaN
4         5       iWatch   499.0

In [29]:
df4.isnull()

   order_id  product  price
0     False    False  False
1     False    False  False
2     False     True   True
3     False    False   True
4     False    False  False

In [30]:
df4.isnull().sum()

order_id    0
product     1
price       2
dtype: int64

In [31]:
df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   order_id  5 non-null      int64
 1   product   4 non-null      object
 2   price     3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [33]:
df4[['product','price']].isnull().sum()

product    1
price      2
dtype: int64

In [34]:
df4.isnull()

   order_id  product  price
0     False    False  False
1     False    False  False
2     False     True   True
3     False    False   True
4     False    False  False

In [35]:
df4.dropna()

   order_id    product   price
0         1  iPhone 14   799.0
1         2    iMac 15  1299.0
4         5     iWatch   499.0

In [37]:
# to replace price with mean
df4

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
2         3          NaN     NaN
3         4  Airpods Pro     NaN
4         5       iWatch   499.0

In [38]:
df4['price'].mean()

865.6666666666666

In [40]:
df4.fillna(0)

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
2         3            0     0.0
3         4  Airpods Pro     0.0
4         5       iWatch   499.0

In [54]:
df4['price'].fillna(df4['price'].mean(),inplace = False)
df4

   order_id      product        price
0         1    iPhone 14   799.000000
1         2      iMac 15  1299.000000
2         3          NaN   865.666667
3         4  Airpods Pro   865.666667
4         5       iWatch   499.000000

In [56]:
# changing column name and data types
df3

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
2         3          NaN     NaN
3         4  Airpods Pro     NaN
4         5       iWatch   499.0

In [57]:
df3.dtypes

order_id      int64
product      object
price       float64
dtype: object

In [58]:
df3['order_id'].astype(float)

   order_id      product   price
0         1    iPhone 14   799.0
1         2      iMac 15  1299.0
2         3          NaN     NaN
3         4  Airpods Pro     NaN
4         5       iWatch   499.0

In [61]:
# changing the column name
df3.rename(columns = {'order_id':'id', 
                      'product':'products'},
                      inplace = True)

In [62]:
df3

   id     products   price
0   1    iPhone 14   799.0
1   2      iMac 15  1299.0
2   3          NaN     NaN
3   4  Airpods Pro     NaN
4   5       iWatch   499.0

In [63]:
df3

   id     products   price
0   1    iPhone 14   799.0
1   2      iMac 15  1299.0
2   3          NaN     NaN
3   4  Airpods Pro     NaN
4   5       iWatch   499.0

In [67]:
df3.shape[1]

3

In [68]:
columns = df3.columns
columns

Index(['id', 'products', 'price'], dtype='object')

In [72]:
for col in columns:
    if df3[col].dtype in(int,float):
        print(f'columns{df3[col]} type :{df3[col].dtype}')
    else:
        print(f'columns{df3[col]} type :{df3[col].dtype}')

columns0    1
1    2
2    3
3    4
4    5
Name: id, dtype: int64 type :int64
columns0      iPhone 14
1        iMac 15
2            NaN
3    Airpods Pro
4         iWatch
Name: products, dtype: object type :object
columns0     799.0
1    1299.0
2       NaN
3       NaN
4     499.0
Name: price, dtype: float64 type :float64